#include "pc_help.h"
#include "hcint.h"
#include "alerts.h"

#define MAX_LINE_LEN 256

typedef struct _editwin {
	/*   0 */ int selection_start_mark;
	/*   2 */ int selection_end_mark;
	/*   4 */ int topline_mark;
	/*   6 */ char window_name[FNAME_MAX];
	/* 134 */ int displayed_lines;
	/* 136 */ int total_lines; /* BUG: should be long */
	/* 138 */ int display_columns;
	/* 140 */ _WORD cursor_y;
	/* 142 */ _WORD cursor_x;
	/* 144 */ _WORD target_column;
	/* 146 */ _WORD left_offset;
	/* 148 */ char inuse;
	/* 149 */ char select_toward_start;
	/* 150 */ char wintype;
} EDITWIN;

EDITWIN editwin;

#define IS_LINK_START(c) ((signed char)(c) < 0)
#define CR_S "\r"

#ifdef __PUREC__
/* not declared in ctype.h */
int isword(unsigned char c);
#else
#define isword(c) (isalnum(c) || c >= 0x80)
#endif

/* ********************************************************************** */
/* ---------------------------------------------------------------------- */
/* ********************************************************************** */

void editwin_set_cursor(_WORD cursor_y, _WORD cursor_x)
{
	EDITWIN *win = &editwin;
	
	win->cursor_y = cursor_y;
	win->cursor_x = cursor_x;
	win->target_column = cursor_x;
	win_set_cursor(cursor_y, cursor_x - win->left_offset);
}

/* ---------------------------------------------------------------------- */

static int expand_tabs(const char *src, char *dst, int srclen, int dstlen)
{
	int srccount;
	int dstcount;
	bool in_link;
	char c;

	srccount = 0;
	dstcount = 0;
